---
title: StructuralSectionLAngle
classe: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
namespace: Autodesk.Revit.DB.Structure.StructuralSections
eredita: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# StructuralSectionLAngle

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BoltDiameterLongerFlange { get; set; }` | `structuralSectionLAngle.BoltDiameterLongerFlange` | Double |
| `Double BoltDiameterShorterFlange { get; set; }` | `structuralSectionLAngle.BoltDiameterShorterFlange` | Double |
| `Double BoltSpacing1LongerFlange { get; set; }` | `structuralSectionLAngle.BoltSpacing1LongerFlange` | Double |
| `Double BoltSpacing2LongerFlange { get; set; }` | `structuralSectionLAngle.BoltSpacing2LongerFlange` | Double |
| `Double BoltSpacingShorterFlange { get; set; }` | `structuralSectionLAngle.BoltSpacingShorterFlange` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```